---
kind: property
id: P:Autodesk.Revit.DB.ExportLayerInfo.ColorNumber
source: html/b4573c4c-4fbf-4cae-9daa-56ae56238c7a.htm
---
# Autodesk.Revit.DB.ExportLayerInfo.ColorNumber Property

The color number stored in value.

## Syntax (C#)
```csharp
public int ColorNumber { get; set; }
```